"use strict"


/**
Создайте две числовые переменные 2 и 8
Создайте строковую переменную, приведите тип первых переменных в строку, сложите их, и присвойте третьей строковой переменной.
Должна получиться строка "28"
Приведите тип строковой переменной в число, и выведите его в консоль
*/

/**
Создайте переменную со значением числа Пи (Math.PI)
Представте число в экспонециальной форме с точностью до 3 символов (toExponential(3))
Пребавте к результату число 1, выведите в консоль результат (должно получиться 3.142e+01)
Измените алгоритм так, чтобы результат был 4.142e+0
 */

/**
Создайте пустую переменную.
Создайте вторую переменную, присвойте в нее преобразование первой в логическое значение
Присвойте первой переменной объектный литерал { foo = 'bar' }
Создайте третью переменную, присвойте в нее преобразование первой в логическое значение
Выведите эти переменные в консоль
*/

/**
Создайте строковые переменные '48 папугаев длина питона' и '10 - количество папугаев в обезьяне'
Получите числа из эти строк используя парсинг (Number.parseInt)
Вычислите сколько обезьян в питоне, выведите в консоль значение через интерполяцию строки: `${numValue} - количество обезьян в питоне`
*/

