'use strict';

/**
Создайте многострочный литерал, выполните в него интерполяцию переменной
*/

/**
Выполните сортировку массива чисел [1,2,3,8,7,6] используя стрелочную функцию как параметр метода sort
*/

/**
For...of
Выполните обход массива с помощью for...of [1,2,3,8,7,6] и вывод его значений в консоль
*/

/**
Создайте копию объекта {x:1,y:2,z:3}, используйте Object.assign()
*/

/**
Добавте в объект {x:1,y:2} другой объект , используйте Object.assign()
*/


/**
Rest parameters
Создайте функцию с параметром оставшихся аргуметов
Вычислите сумму всех аргументов
*/

/**
Создайте функцию с параметром по умолчанию.
Выведите в консоль значение параметра.
Вызовите функцию с параметром и без, убедитесь что параметр по умолчанию используется
*/

/**
С помощью деструкции создате переменные x, y из объекта { x: 1, y: 2}
*/

/**
Дан массив [1,2,3,3,2,1]
с помощью объекта Set сделайте новый массив с уникальными значениями, выведите в консоль
*/

/**
Создайте класс Person, имеющий геттер и сеттер свойства name
*/

/**
Создайте две функции разрешающие промис с использованием setTimeout() через 1 и 2 секунды соответственно
В функциях выведите в консоль момент ее разрешения.
Создайте третью, которая запускает одновременно выполнение первых функций, и после выполнения обоих выводит
об этом информацию в консоль
*/

/**
Дан текстареа. В него вводится текст.
Сделайте так, чтобы после захода на эту страницу через некоторое время,
введенный текст остался в текстареа. Текст должен запоминаться в локальном хранилище.
*/

/**
Реализуйте записную книгу, хранящую данные в локальном хранилище.
*/

/**
Дана строка 'aa aba abba abbba abca abea'. Напишите регулярку,
которая найдет строки aa, aba по шаблону: буква 'a', буква 'b' один раз или ниодного, буква 'a'.
*/

/**
Дана строка '*+ *q+ *qq+ *qqq+ *qqq qqq+'.
Напишите регулярку, которая найдет строки *q+, *qq+, *qqq+, не захватив остальные.
*/