'use strict';

/**
Выведите столбец чисел от 1 до 50. (while)

*/

/**
Дан массив с элементами [1, 2, 3, 4, 5]. С помощью цикла for выведите все эти элементы на экран.
*/

/**
Дан массив с элементами [2, 3, 4, 5]. С помощью цикла for найдите произведение элементов этого массива.
*/

/**
Дан объект obj с ключами 'Минск', 'Москва', 'Киев' с элементами 'Беларусь', 'Россия', 'Украина'. С помощью цикла for-in выведите на экран строки такого формата: 'Минск - это Беларусь.'.
*/

/**
Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла for и оператора if выведите на экран столбец тех элементов массива, которые больше 3-х, но меньше 10.
*/

/**
Дан массив с числами. Числа могут быть положительными и отрицательными. Найдите сумму положительных элементов массива.
*/

/**



*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

