"use strict";


/**
Создайте функцию  выводящих в консоль всех свойст объекта { x: 1, y: 2, foo: 'bar' }
Используйте синтаксис декларации функции (Function Declaration)
*/

/**
Создайте функцию для вычисления факториала
Используйте синтакстис функционального выражения (Function Expression)
*/

/**
Создайте функцию для вычисления квадрата числа
Используйте стрелочную нотацию
*/

/**
Создайте функцию конструктор, создающую объект с артрибутами firstName, lastName
Объект должен содержать метод hello(); Выводящий приветствие firstName в консоль
Добавте в прототип функции метод bye(); Выводящий проание с firstName в консоль
Вызовите метод bye у объекта.
*/

/**
Добавте в глобальный объект свойство author = 'Your Name';
Создайте объкт используя объектный литерал, например: { foo: 'bar' }, убедитесь в наличии свойства author у объекта
Измените прототип объекта, используя ранее экземпляр объекта
*/

/**
Создайте функцию возвращающую сумму всех аргументов (используйте arguments)
*/
