"use strict"

console.log('Hello world!');

/**
Создайте переменные и инициализируйте их следующими литералами:
целое число
дробное число
строка (создайте три строки используя разные литералы (', ", `))
    при создании строки через ` сделайте интерполяцию (интерполяция - нахождение переменных в строках и замена их на значение) раннее созданной целочисленной переменной
дата и время
логическое значение
объект

Выведите значения переменных в консоль

Создайте функции тремя различными способами:
1. Используя ключевое слово function
2. Объявление Function Expression
3. Стрелочные функции


*/
