"use strict";

/**
Создайте конструктор Person со свойствами first, last, age
Создайте констркутор Teacher
Дополните Teacher свойством subject

Используйте старый и новый синтактситс для создания конструкторов
*/

/**
Создайте класс Transformer: включающий в себя методы run, fire, stop. Методы должны именять переменную state
Добавте метод printState - выводящее в консоль текущее состояние трансформера.
Создайте класс Autobot: включающий метод transform (код, отвечающий за трансформацию в автомобиль)
Создайте класс Decepticon: включающий метод transform (код, отвечающий за трансформацию в самолет)
Методы transform должны изменять свойство form, в этом свойстве будет хранится текущяя форма трансформера
Добавте метод в классы наследники printForm, выведите в консоль текущую форму робота.

Используйте старый и новый синтактситс для создания конструкторов
*/

