/**
Выведите алерт по нажатию на кнопку
*/

/**
Измените текста в инпуте
*/

/**
Выведите содержимое инпута в алерте
*/

/**
Поменяйте содержимым между инпутами
*/

/**
По нажатию на кнопку измените ее текст
*/

/**
Поменяйте цвет теста импуте на красный
*/

// ----

/**
Сделайте две кнопки, одна блокирует инпут, другая разблокирует
*/

/**
Сделайте div элемент не видимым при нажатии кнопки
*/

/**
Удалите элемент из потока отображения DOM дерева
*/


/**
В странице есть блок div, вставте в него новый input
*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/

/**

*/
